; domain
(define (domain GROCERY)
    (:requirements :strips :typing :adl)
    (:types item)
    (:predicates (on ?x - item ?y - item)
                 (inbox ?x - item)
                 (inclutter ?x - item)
                 (beside ?x - item ?y - item)
                 (handempty)
                 (holding ?x - item)
                 (topfree ?x - item)
                 (boxfull)
                 )
                 
    
    (:action pick-from-clutter
            :parameters (?x - item)
            :precondition (and (topfree ?x) (handempty) (inclutter ?x))
            :effect
            (and (holding ?x)
                (not (handempty))
                (not (inbox ?x))
                (not (inclutter ?x))
                (not (topfree ?x)))
    )
    
    (:action pick-from-box
            :parameters (?x - item)
            :precondition (and (topfree ?x) (handempty) (inbox ?x))
            :effect
            (and (holding ?x)
                (not (boxfull))
                (not (handempty))
                (not (inbox ?x))
                (not (inclutter ?x))
                (not (topfree ?x)))
    )
    
    (:action pick-from
            :parameters (?x - item ?y - item)
            :precondition (and (on ?x ?y) (topfree ?x) (handempty))
            :effect
            (and (holding ?x)
                (not (handempty))
                (not (on ?x ?y))
                (not (inbox ?x))
                (not (inclutter ?x))
                (not (topfree ?x))
                (topfree ?y))
    )
    
    (:action put-in-clutter
            :parameters (?x - item)
            :precondition (holding ?x)
            :effect
            (and (not (holding ?x))
                (handempty)
                (inclutter ?x)
                (topfree ?x))
    )
    
    (:action put-in-box
            :parameters (?x - item)
            :precondition  (and (holding ?x) (not (boxfull)))
            :effect
            (and (not (holding ?x))
                (handempty)
                (inbox ?x)
                (topfree ?x))
    )
    
    (:action put-on 
            :parameters (?x - item ?y - item)
            :precondition (and (holding ?x) (topfree ?y) )
            :effect
            (and (not (holding ?x))
                (on ?x ?y)
                (handempty)
                (topfree ?x)
                (not (topfree ?y)))
    )
)

; problem
(define (problem PACKED-GROCERY) 
(:domain GROCERY) 
 (:objects h3 m3 m5 m6 m1 m4 h2 h1 m0 h0 m2 h4 - item)
(:init (handempty) (inbox m0) (topfree m0) (inbox m1) (topfree m1) (inbox m2) (topfree m2) (inbox m3) (topfree m3) (topfree m4) (inclutter m4) (topfree h0) (inclutter h0) (topfree h1) (inclutter h1) (topfree h2) (inclutter h2) (topfree m5) (inclutter m5) (topfree h3) (inclutter h3) (topfree h4) (inclutter h4) (topfree m6) (inclutter m6) (boxfull))
(:goal (and (inbox h0) (inbox h1) (inbox h2) (inbox h3) (inbox h4) (or (on m0 h0) (on m0 h1) (on m0 h2) (on m0 h3) (on m0 h4) ) (or (on m1 h0) (on m1 h1) (on m1 h2) (on m1 h3) (on m1 h4) ) (or (on m2 h0) (on m2 h1) (on m2 h2) (on m2 h3) (on m2 h4) ) (or (on m3 h0) (on m3 h1) (on m3 h2) (on m3 h3) (on m3 h4) ) (or (on m4 h0) (on m4 h1) (on m4 h2) (on m4 h3) (on m4 h4) ) (or (on m5 m0) (on m5 m1) (on m5 m2) (on m5 m3) (on m5 m4) ) (or (on m6 m0) (on m6 m1) (on m6 m2) (on m6 m3) (on m6 m4) ) )))

; plan
1. (pick-from-box m0)
   deleted: (boxfull) (handempty) (inbox m0) (topfree m0)
   added: (holding m0)
   goals met: 0 of 12
2. (put-on m0 h0)
   deleted: (holding m0) (topfree h0)
   added: (on m0 h0) (handempty) (topfree m0)
   goals met: 1 of 12
3. (pick-from-clutter h1)
   deleted: (handempty) (inclutter h1) (topfree h1)
   added: (holding h1)
   goals met: 1 of 12
4. (put-in-box h1)
   deleted: (holding h1)
   added: (handempty) (inbox h1) (topfree h1)
   goals met: 2 of 12
5. (pick-from-clutter h2)
   deleted: (handempty) (inclutter h2) (topfree h2)
   added: (holding h2)
   goals met: 2 of 12
6. (put-in-box h2)
   deleted: (holding h2)
   added: (handempty) (inbox h2) (topfree h2)
   goals met: 3 of 12
7. (pick-from-clutter h3)
   deleted: (handempty) (inclutter h3) (topfree h3)
   added: (holding h3)
   goals met: 3 of 12
8. (put-in-box h3)
   deleted: (holding h3)
   added: (handempty) (inbox h3) (topfree h3)
   goals met: 4 of 12
9. (pick-from-clutter h4)
   deleted: (handempty) (inclutter h4) (topfree h4)
   added: (holding h4)
   goals met: 4 of 12
10. (put-in-box h4)
   deleted: (holding h4)
   added: (handempty) (inbox h4) (topfree h4)
   goals met: 5 of 12
11. (pick-from-box m1)
   deleted: (handempty) (inbox m1) (topfree m1)
   added: (holding m1)
   goals met: 5 of 12
12. (put-on m1 h1)
   deleted: (holding m1) (topfree h1)
   added: (on m1 h1) (handempty) (topfree m1)
   goals met: 6 of 12
13. (pick-from-box m2)
   deleted: (handempty) (inbox m2) (topfree m2)
   added: (holding m2)
   goals met: 6 of 12
14. (put-on m2 h2)
   deleted: (holding m2) (topfree h2)
   added: (on m2 h2) (handempty) (topfree m2)
   goals met: 7 of 12
15. (pick-from-box m3)
   deleted: (handempty) (inbox m3) (topfree m3)
   added: (holding m3)
   goals met: 7 of 12
16. (put-on m3 h3)
   deleted: (holding m3) (topfree h3)
   added: (on m3 h3) (handempty) (topfree m3)
   goals met: 8 of 12
17. (pick-from-clutter m5)
   deleted: (handempty) (inclutter m5) (topfree m5)
   added: (holding m5)
   goals met: 8 of 12
18. (put-on m5 m1)
   deleted: (holding m5) (topfree m1)
   added: (on m5 m1) (handempty) (topfree m5)
   goals met: 9 of 12
19. (pick-from-clutter m6)
   deleted: (handempty) (inclutter m6) (topfree m6)
   added: (holding m6)
   goals met: 9 of 12
20. (put-on m6 m2)
   deleted: (holding m6) (topfree m2)
   added: (on m6 m2) (handempty) (topfree m6)
   goals met: 10 of 12
21. (pick-from m0 h0)
   deleted: (handempty) (on m0 h0) (topfree m0)
   added: (holding m0) (topfree h0)
   goals met: 9 of 12
22. (put-on m0 h4)
   deleted: (holding m0) (topfree h4)
   added: (on m0 h4) (handempty) (topfree m0)
   goals met: 10 of 12
23. (pick-from-clutter h0)
   deleted: (handempty) (inclutter h0) (topfree h0)
   added: (holding h0)
   goals met: 10 of 12
24. (put-in-box h0)
   deleted: (holding h0)
   added: (handempty) (inbox h0) (topfree h0)
   goals met: 11 of 12
25. (pick-from-clutter m4)
   deleted: (handempty) (inclutter m4) (topfree m4)
   added: (holding m4)
   goals met: 11 of 12
26. (put-on m4 h0)
   deleted: (holding m4) (topfree h0)
   added: (on m4 h0) (handempty) (topfree m4)
   goals met: 12 of 12
